import { defineStore } from 'pinia'
import { ref } from 'vue'
export const useTaskStore = defineStore('task', () => {
  const tasks = ref({
    '2026-01-01': ['新年快樂', '冷藏包裝', '回覆客戶詢問'],
    '2026-01-05': ['寄送訂單', '補貨盤點'],
    '2026-01-06': ['農產品上架', '更新價格'],
    '2026-01-10': ['準備新年促銷'],
    '2026-01-15': ['處理退貨', '聯絡物流'],
    '2026-01-27': ['盤點庫存', '整理報表'],
    '2026-01-31': ['新年促銷活動', '補貨安排'],
    '2026-02-12': ['物流出貨截止'],
    '2026-02-15': ['回訪老客戶', '農場例行檢查'],
    '2026-02-16': ['除夕'],
    '2026-02-17': ['過年開始'],
    '2026-02-23': ['開工'],
    '2026-04-01': ['愚人節'],
    '2026-04-03': ['4天連假開始'],
    '2026-04-04': ['兒童節','注意豪大雨'],
    '2026-04-05': ['清明節'],
    '2026-04-19': ['回訪老客戶'],
    '2026-04-20': ['更改促銷活動','網站更新'],
    '2026-04-30': ['回訪老客戶'],
    '2026-05-01': ['勞動節','農場例行檢查'],
    '2026-05-05': ['立夏'],
    '2026-05-15': ['作物收成與替換'],
    '2026-05-20': ['農場例行檢查','購買節慶商品'],
    '2026-05-29': ['回訪老客戶'],
    '2026-06-10': ['參加生日聚會','修改商品資料'],
    '2026-06-15': ['農場例行性檢查'],
    '2026-06-18': ['檔期資訊更新','價格調整'],
    '2026-06-19': ['端午節','連假三天開始'],
    '2026-06-22': ['農場例行檢查'],
    '2026-06-27': ['更新商品圖片'],
  })
  function getTasksByDate(dateKey){
    return tasks.value[dateKey] || []
  }
  return { tasks, getTasksByDate }
})
